truncate automobile CASCADE;
truncate claim CASCADE;
truncate client CASCADE;
truncate invoice CASCADE;
truncate partner CASCADE;
truncate rent CASCADE;
truncate service CASCADE;
truncate type_of_work CASCADE;

SET lc_monetary TO "en_US.UTF-8";

INSERT INTO automobile VALUES
(1,'Lada 2102','A111AA 1', '2002-06-01', 40000, false, 2, 10, '2022-12-01', 110 ),
(2,'Lada 2106','B111BB 1', '1998-06-01', 80000, false, 2, 10, '2022-12-01', 110),
(3,'BMW X5','B222BB 1', '2010-06-01', 10000, true, 2, 10, '2022-12-01',150),
(4,'BMW X6','A222AA 1', '2010-06-01', 10000, true, 2, 10, '2022-12-01', 160),
(5,'Mercedes-Benz G-Class','B228OP 1', '2015-06-01', 5000, true, 2, 40, '2022-12-01',200),
(6,'Mercedes-Benz E-Class','B228OP 11', '2015-06-01', 5001, true, 2, 10, '2022-12-01',200),
(7,'Mazda CX-5','O111OO 1', '2018-06-01', 3000, true, 2, 10, '2022-12-01',130),
(8,'Mazda CX-6','H111HH 1', '2018-06-01', 2000, true, 2, 10, '2022-12-01',130),
(9,'Toyota Camry','T888TT 1', '2007-06-01', 100000, false, 2, 10, '2022-12-01',120),
(10,'Toyota Camry','T888TT 2', '2007-06-01', 100001, false, 2, 10, '2022-12-01',120),
(11,'Toyota Camry','T222TT 2', '2007-06-01', 110001, false, 2, 10, '2022-12-01',120),
(12,'Toyota ae86','P777OK 17', '1998-06-01', 210001, true, 2, 10, '2022-12-01',1000);

INSERT INTO type_of_work VALUES
(1,'Мойка','ну моем машину короче'),
(2, 'ТО', 'ну проверяем машину короче'),
(3, 'Заправка', 'ну заправляем машину короче');

INSERT INTO partner VALUES
(1,'ТО МОСКВА', 'г.Москва', '111122233334444'),
(2,'Мойка Химки', 'г.Химки', '4444222233334444'),
(3,'Заправка Москва', 'г.Москва', '999922233334444');

INSERT INTO service VALUES
(1,'2022-12-01', 'г.Москва', 1, 2, 1),
(2,'2022-12-01', 'г.Москва', 2, 2, 1),
(3,'2022-12-01', 'г.Москва', 3, 2, 1),
(4,'2022-12-01', 'г.Москва', 4, 2, 1),
(5,'2022-12-01', 'г.Москва', 5, 2, 1),
(6,'2022-12-01', 'г.Москва', 6, 2, 1),
(7,'2022-12-01', 'г.Москва', 7, 2, 1),
(8,'2022-12-01', 'г.Москва', 8, 2, 1),
(9,'2022-12-01', 'г.Москва', 9, 2, 1),
(10,'2022-12-01', 'г.Москва', 10, 2, 1),
(11,'2022-12-01', 'г.Москва', 11, 2, 1),
(12,'2022-12-01', 'г.Москва', 12, 2, 1);

INSERT INTO client VALUES
(1,'Золотов','Андрей','Сергеевич','2003-12-12','1234567890',true,'test@test.com', '79994449922'),
(2,'Смирнов','Андрей','Сергеевич','2003-12-11','1234567890',true,'test@test.com', '79994449922'),
(3,'Сергеев','Сергей','Сергеевич','2003-11-11','1234567890',true,'test@test.com', '79994449922'),
(4,'Иванов','Иван','Сергеевич','2003-10-10','1234567890',true,'test@test.com', '79994449922');

INSERT INTO rent VALUES
(1,12,1,'2023-09-10','2023-10-10','г.Москва','г.Москва',1000,false),
(2,1,2,'2023-09-10','2023-10-10','г.Москва','г.Москва',1337,true),
(3,8,3,'2023-09-10','2023-10-10','г.Москва','г.Москва',777,false),
(4,4,4,'2023-09-10','2023-10-10','г.Москва','г.Москва',299,false);

INSERT INTO invoice VALUES
(1,1,'2023-09-10',60000),
(2,2,'2023-09-10',10000),
(3,3,'2023-09-10',100000),
(4,4,'2023-09-10',40000);

INSERT INTO claim VALUES
(1,2,'2023-10-11','не заправил');

